/*
INSERT INTO products (product_name, purchase_company, product_code, 
					  purchase_date, warranty_period, description)						# 插入資料
#VALUES ('商品A', '公司X', 'CODE123', '2024-10-01 10:00:00', 12, '這是商品A的備註。');	# 資料範本

VALUES ('商品Q', '公司ZZ', 'CODE900', '2024-11-23 14:30:35', '12', '故障事件 : .........................\n故障原因 : .........................\n解決方式 : .........................'),
	   ('商品Q', '公司ZZ', 'CODE901', '2024-11-23 14:30:35', '12', '故障事件 : .........................\n故障原因 : .........................\n解決方式 : .........................'),
       ('商品Q', '公司ZZ', 'CODE902', '2024-11-23 14:30:35', '12', '故障事件 : .........................\n故障原因 : .........................\n解決方式 : .........................');
*/

# 在 products 表中插入資料
# 模板 ('產品', '公司', 'CODE111', '2024-09-24 14:30:35', '保固幾個月', '購買備註');
INSERT INTO
	products (product_name, purchase_company, product_code, purchase_date, warranty_period, description)
VALUES
	('產品A', '公司GG', 'CODE117', '2024-09-30 11:36:11', '72', '購買的的備註'),
    ('產品B', '公司RR', 'CODE118', '2024-10-01 12:24:23', '24', '購買的的備註'),
    ('產品C', '公司UU', 'CODE119', '2024-10-02 13:23:57', '36', '購買的的備註'),
    ('產品D', '公司II', 'CODE120', '2024-10-03 14:06:35', '48', '購買的的備註'),
    ('產品E', '公司OO', 'CODE121', '2024-10-08 15:34:22', '60', '購買的的備註'),
    ('產品F', '公司PP', 'CODE122', '2024-10-09 16:55:09', '72', '購買的的備註');
    
    