/*
INSERT INTO products (product_name, purchase_company, product_code, 
					  purchase_date, warranty_period, description)						# 插入資料
#VALUES ('商品A', '公司X', 'CODE123', '2024-10-01 10:00:00', 12, '這是商品A的備註。');	# 資料範本

VALUES ('商品Q', '公司ZZ', 'CODE900', '2024-11-23 14:30:35', '12', '故障事件 : .........................\n故障原因 : .........................\n解決方式 : .........................'),
	   ('商品Q', '公司ZZ', 'CODE901', '2024-11-23 14:30:35', '12', '故障事件 : .........................\n故障原因 : .........................\n解決方式 : .........................'),
       ('商品Q', '公司ZZ', 'CODE902', '2024-11-23 14:30:35', '12', '故障事件 : .........................\n故障原因 : .........................\n解決方式 : .........................');
*/

# 在 products 表中插入資料
# 模板 ('產品', '公司', 'CODE111', '2024-09-24 14:30:35', '保固幾個月', '購買備註');
USE product_test;
INSERT INTO
	products (
		product_name,
        purchase_company,
        product_code,
        purchase_date,
        warranty_period,
        description
	)
VALUES
	('產品A', '公司EW', 'CODE130', '2024-01-10 10:36:11', '12', '換貨測試'),
    ('產品A', '公司EW', 'CODE131', '2024-01-11 10:36:11', '12', '換貨後測試');
    
    